app/Http/Controllers/FrontEndController.php

                'features'=>$features,
                'availableLanguages'=>$availableLanguages,
                'locale'=>$locale,
                'pages'=>Pages::where('showAsLink',1)->get()
---
select * from `pages` where `showAsLink` = 1

    public function restorant($enterprise, $alias){
        $subDomain=$this->getSubDomain();
        $enterprise = Enterprises::where('name', $enterprise)->first();
        $restorant = Restorant::where('subdomain',$alias)->first();
---
select * from `enterprises` where `name` = 'restaurant' limit 1
select * from `restorants` where `subdomain` = 'leukapizza' limit 1