app/Http/Controllers/HomeController.php

select * from `restorants` where `restorants`.`user_id` = 2 and `restorants`.`user_id` is not null limit 1
---

                        //dd(Carbon::now()->format('M'));
            $views=Restorant::sum('views');
            return view('dashboard', [
                'last30daysOrders' => $last30daysOrders,
                'last30daysOrdersValue'=> $last30daysOrdersValue,
                'uniqueUsersOrders' => $uniqueUsersOrders,
                'allClients' => $allClients,
                'allViews' => $views,
                'salesValue' => $salesValue,
                'monthLabels' => $monthLabels,
                'totalOrders' => $totalOrders,
                'countItems'=>Restorant::count(),
                'last30daysDeliveryFee' => $last30daysDeliveryFee,
                'last30daysStaticFee' => $last30daysStaticFee,
                'last30daysDynamicFee' => $last30daysDynamicFee,
                'last30daysTotalFee' => $last30daysTotalFee,
                'months' => $months
            ]);

select count(*) as aggregate from `orders` where (`created_at` > '2022-01-04 21:10:40' and `restorant_id` = 1)
select sum(`order_price`) as aggregate from `orders` where (`created_at` > '2022-01-04 21:10:40' and `restorant_id` = 1 and `payment_status` = 'paid')
select `client_id` from `orders` where `restorant_id` = 1 group by `client_id`
---
            $restorant_id = auth()->user()->restorant->id;
            $last30days = Carbon::now()->subDays(30);
            // $last30daysOrders = Order::all()->where('created_at', '>', $last30days, 'AND', 'restorant_id', '=' ,$restorant_id)->count();
            $last30daysOrders = Order::where([
                ['created_at', '>', $last30days],
                ['restorant_id', '=' ,$restorant_id]
            ])->count();

            //$last30daysOrdersValue = Order::all()->where('created_at', '>', $last30days, 'AND', 'restorant_id', '=', $restorant_id)->sum('order_price');
            $last30daysOrdersValue = Order::where([
                ['created_at', '>', $last30days],
                ['restorant_id', '=', $restorant_id],
                ['payment_status', '=', 'paid']
            ])->sum('order_price');

            //$uniqueUsersOrders = Order::all()->unique('address_id')->where('restorant_id', '=', $restorant_id)->count();
            $uniqueUsersOrders = Order::select('client_id')->where('restorant_id', '=', $restorant_id)->groupBy('client_id')->get()->count();

select SUM(order_price + delivery_price) AS sumValue from `orders` where (`created_at` > '2021-08-01 00:00:00' and `restorant_id` = 1 and `payment_status` = 'paid') group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc
---
                        ->groupBy(DB::raw("YEAR(created_at), MONTH(created_at)"))
                        ->orderBy(DB::raw("YEAR(created_at), MONTH(created_at)"), 'asc')
                        ->pluck('sumValue');*/
            $salesValue = DB::table('orders')
                        ->select(DB::raw('SUM(order_price + delivery_price) AS sumValue'))
                        ->where([['created_at', '>', $sevenMonthsDate], ['restorant_id', '=', $restorant_id], ['payment_status', '=', 'paid']])
                        ->groupBy(DB::raw("YEAR(created_at), MONTH(created_at)"))
                        ->orderBy(DB::raw("YEAR(created_at), MONTH(created_at)"), 'asc')
                        ->pluck('sumValue');

select MONTH(created_at) as month from `orders` where (`created_at` > '2021-08-01 00:00:00' and `restorant_id` = 1) group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc
---
                        ->groupBy(DB::raw("YEAR(created_at), MONTH(created_at)"))
                        ->orderBy(DB::raw("YEAR(created_at), MONTH(created_at)"), 'asc')
                        ->pluck('month');*/
            $monthLabels = DB::table('orders')
                        ->select(DB::raw('MONTH(created_at) as month'))
                        ->where([['created_at', '>', $sevenMonthsDate], ['restorant_id', '=', $restorant_id]])
                        ->groupBy(DB::raw("YEAR(created_at), MONTH(created_at)"))
                        ->orderBy(DB::raw("YEAR(created_at), MONTH(created_at)"), 'asc')
                        ->pluck('month');

select count(id) as totalPerMonth from `orders` where (`created_at` > '2021-08-01 00:00:00' and `restorant_id` = 1) group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc
select sum(`delivery_price`) as aggregate from `orders` where (`created_at` > '2022-01-04 21:10:40' and `restorant_id` = 1)
select sum(`static_fee`) as aggregate from `orders` where (`created_at` > '2022-01-04 21:10:40' and `restorant_id` = 1)
select sum(`fee_value`) as aggregate from `orders` where (`created_at` > '2022-01-04 21:10:40' and `restorant_id` = 1)
select SUM(delivery_price + static_fee + fee_value) AS sumValue from `orders` where (`created_at` > '2022-01-04 21:10:40' and `restorant_id` = 1) limit 1
select count(*) as aggregate from `items` where `category_id` in (1, 2, 3, 4) and `items`.`deleted_at` is null
---
                        ->groupBy(DB::raw("YEAR(created_at), MONTH(created_at)"))
                        ->orderBy(DB::raw("YEAR(created_at), MONTH(created_at)"), 'asc')
                        ->pluck('totalPerMonth');*/
            $totalOrders = DB::table('orders')
                        ->select(DB::raw('count(id) as totalPerMonth'))
                        ->where([['created_at', '>', $sevenMonthsDate],['restorant_id', '=', $restorant_id]])
                        ->groupBy(DB::raw("YEAR(created_at), MONTH(created_at)"))
                        ->orderBy(DB::raw("YEAR(created_at), MONTH(created_at)"), 'asc')
                        ->pluck('totalPerMonth');

            $last30daysDeliveryFee = Order::where([['created_at', '>', $last30days],['restorant_id', '=', $restorant_id]])->sum('delivery_price');
            $last30daysStaticFee = Order::where([['created_at', '>', $last30days],['restorant_id', '=', $restorant_id]])->sum('static_fee');
            $last30daysDynamicFee = Order::where([['created_at', '>', $last30days],['restorant_id', '=', $restorant_id]])->sum('fee_value');
            $last30daysTotalFee = DB::table('orders')
                                ->select(DB::raw('SUM(delivery_price + static_fee + fee_value) AS sumValue'))
                                ->where([['created_at', '>', $last30days],['restorant_id', '=', $restorant_id]])
                                ->value('sumValue');
            $itemsCount=Items::whereIn('category_id', auth()->user()->restorant->categories->pluck('id')->toArray())->count();