app/Http/Controllers/ItemsController.php

    public function index()
    {
        if(auth()->user()->hasRole('owner')){
            $canAdd=true;
            if(config('app.isqrsaas')){
                //In QRsaas with plans, we need to check if they can add new items.
                $currentPlan=Plans::withTrashed()->find(auth()->user()->mplanid());
                if($currentPlan==null){
                    return redirect()->route('plans.current')->withStatus(__('Please subscribe to a plan first'));
                }
                $items=Items::whereIn('category_id', auth()->user()->restorant->categories->pluck('id')->toArray());
                if($currentPlan->limit_items!=0){
                    $canAdd=$currentPlan->limit_items>$items->count();
                }
            }
            return view('items.index', [
                'canAdd'=>$canAdd,
                'enterprise'=> Enterprises::where('id', auth()->user()->restorant->enterprise_id)->get()->first(),
                'categories' => auth()->user()->restorant->categories->reverse(),
                'restorant_id' => auth()->user()->restorant->id]);
---
select * from `plan` where `plan`.`id` = 3 limit 1
select * from `restorants` where `restorants`.`user_id` = 2 and `restorants`.`user_id` is not null limit 1