app/Http/Controllers/OrderController.php

    public function index(Request $request)
    {
        $this->migrateStatuses();

        $restorants = Restorant::where(['active'=>1])->get();
---
select * from `restorants` where (`active` = 1)

    public function liveapi(){

        //TODO - Method not allowed for client or driver
        if(auth()->user()->hasRole('client')){
           dd("Not allowed as client");
        }

        //Today only
        $orders = Order::where('created_at', '>=', Carbon::today())->orderBy('created_at','desc');

        //If owner, only from his restorant
        if(auth()->user()->hasRole('owner')){
            $orders = $orders->where(['restorant_id'=>auth()->user()->restorant->id]);
        }
        $orders=$orders->with(['status','client','restorant','table.restoarea'])->get()->toArray();
---
select * from `restorants` where `restorants`.`user_id` = 2 and `restorants`.`user_id` is not null limit 1
select * from `orders` where `created_at` >= '2022-02-04 00:00:00' and (`restorant_id` = 1) order by `created_at` desc