app/Http/Controllers/PlansController.php

        $plans=Plans::get()->toArray();
        $colCounter=[4,12,6,4,3,4,4,4,4,4,4,4,4,4,4,4,4];

        $currentUserPlan=Plans::withTrashed()->find(auth()->user()->mplanid());
---
select * from `plan` where `plan`.`id` = 3 limit 1

    public function price(Request $request)
    {
        $plan_id = $request->input('plan_id');
        $price_type = $request->input('price_type');
        $plan = Plans::where('id', $plan_id)->get()->first();
---
select * from `plan` where `id` = '3' and `plan`.`deleted_at` is null