app/Http/Controllers/RestorantController.php

select * from `restorants` where `id` = '1'
select * from `enterprises`
select * from `enterprises` where `id` = 1
---
    public function edit($restaurant_id)
    {
        $restaurant = Restorant::where('id',$restaurant_id)->get()->first();
        $enterprises = Enterprises::all();
        $enterprise = Enterprises::where('id', $restaurant->enterprise_id)->get()->first();

select * from `restorants` where `id` = '1'
select * from `enterprises` where `id` is null
---
    public function update(Request $request, $restaurant)
    {
        $phone = env('IS_WHATSAPP_ORDERING_MODE',false) ? "whatsapp_phone" : "phone";
        $restaurant = Restorant::where('id', $restaurant)->get()->first();
        $enterprise = Enterprises::where('id', intval($restaurant->enterprise_id))->get()->first();

select * from `restorants` where `restorants`.`user_id` = 2 and `restorants`.`user_id` is not null limit 1
---
    public function shareMenu()
    {
        $this->authChecker();

        if(env('WILDCARD_DOMAIN_READY',false)){
            $url = (isset($_SERVER['HTTPS'])&&$_SERVER["HTTPS"] ?"https://":"http://").auth()->user()->restorant->subdomain.".".str_replace("www.","",$_SERVER['HTTP_HOST']);
        }else{
            $enterprise = Enterprises::find(auth()->user()->restorant->enterprise_id);