app/Http/Controllers/VisitsController.php

    private function getFields($class="col-md-6",$restaurant=null){
        if($restaurant==null){
            $restaurant=$this->getRestaurant();
        }

        $tables=Tables::where('restaurant_id',$restaurant->id)->get();
---
select * from `tables` where `restaurant_id` = 1